; ModuleID = '__uClibc_main.os'
source_filename = "libc/misc/internals/__uClibc_main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.__uclibc_locale_struct.193 = type { i16*, i16*, i16*, [384 x i16], [384 x i16], [384 x i16], [14 x i8], [6 x i16], [6 x i8], i8, i8, [10 x i8], i8*, i8*, i8*, i8*, i8*, i16*, i8*, i8*, i16*, i8*, i8*, i16*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__collate_t.192 }
%struct.__collate_t.192 = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16 }
%struct.__STDIO_FILE_STRUCT.560 = type { i16, [2 x i8], i32, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__STDIO_FILE_STRUCT.560*, [2 x i32], %struct.__mbstate_t.559, i8* }
%struct.__mbstate_t.559 = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__libc_stack_end", scope: !2, file: !3, line: 52, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 13.0.1-11ubuntu14.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "libc/misc/internals/__uClibc_main.c", directory: "/home/mdshafiuzzaman/Research/klee/klee-uclibc")
!4 = !{}
!5 = !{!6, !7, !9, !11, !23, !25}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_auxv_t", file: !13, line: 1036, baseType: !14)
!13 = !DIFile(filename: "./include/elf.h", directory: "/home/mdshafiuzzaman/Research/klee/klee-uclibc")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1026, size: 128, elements: !15)
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "a_type", scope: !14, file: !13, line: 1028, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 58, baseType: !10)
!18 = !DIFile(filename: "./include/stdint.h", directory: "/home/mdshafiuzzaman/Research/klee/klee-uclibc")
!19 = !DIDerivedType(tag: DW_TAG_member, name: "a_un", scope: !14, file: !13, line: 1035, baseType: !20, size: 64, offset: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !13, line: 1029, size: 64, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "a_val", scope: !20, file: !13, line: 1031, baseType: !17, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 46, baseType: !10)
!24 = !DIFile(filename: "/usr/lib/llvm-13/lib/clang/13.0.1/include/stddef.h", directory: "")
!25 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!0, !27, !31, !33, !35, !38, !40, !46, !49}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "__uclibc_progname", scope: !2, file: !3, line: 110, type: !29, isLocal: false, isDefinition: true)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "program_invocation_short_name", scope: !2, file: !3, line: 112, type: !29, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "program_invocation_name", scope: !2, file: !3, line: 113, type: !29, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "__environ", scope: !2, file: !3, line: 125, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "__pagesize", scope: !2, file: !3, line: 129, type: !23, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !42, file: !3, line: 189, type: !45, isLocal: true, isDefinition: true)
!42 = distinct !DISubprogram(name: "__uClibc_init", scope: !3, file: !3, line: 187, type: !43, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!43 = !DISubroutineType(types: !44)
!44 = !{null}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "__app_fini", scope: !2, file: !3, line: 244, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "__rtld_fini", scope: !2, file: !3, line: 247, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "n_calls", scope: !53, file: !54, line: 299, type: !45, isLocal: true, isDefinition: true)
!53 = distinct !DISubprogram(name: "close", scope: !54, file: !54, line: 298, type: !55, scopeLine: 298, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!54 = !DIFile(filename: "klee/runtime/POSIX/fd.c", directory: "/home/mdshafiuzzaman/Research/klee")
!55 = !DISubroutineType(types: !56)
!56 = !{!45, !45}
!57 = distinct !DICompileUnit(language: DW_LANG_C89, file: !58, producer: "Ubuntu clang version 13.0.1-11ubuntu14.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, retainedTypes: !80, globals: !139, splitDebugInlining: false, nameTableKind: None)
!58 = !DIFile(filename: "/home/mdshafiuzzaman/Research/klee/klee/runtime/POSIX/fd.c", directory: "/home/mdshafiuzzaman/Research/klee/klee_build/runtime/POSIX")
!59 = !{!60, !68}
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 58, baseType: !62, size: 32, elements: !63)
!61 = !DIFile(filename: "klee/runtime/POSIX/fd.h", directory: "/home/mdshafiuzzaman/Research/klee")
!62 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!63 = !{!64, !65, !66, !67}
!64 = !DIEnumerator(name: "eOpen", value: 1)
!65 = !DIEnumerator(name: "eCloseOnExec", value: 2)
!66 = !DIEnumerator(name: "eReadable", value: 4)
!67 = !DIEnumerator(name: "eWriteable", value: 8)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 97, baseType: !62, size: 32, elements: !70)
!69 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!70 = !{!71, !72, !73, !74, !75, !76, !77, !78, !79}
!71 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!72 = !DIEnumerator(name: "DT_FIFO", value: 1)
!73 = !DIEnumerator(name: "DT_CHR", value: 2)
!74 = !DIEnumerator(name: "DT_DIR", value: 4)
!75 = !DIEnumerator(name: "DT_BLK", value: 6)
!76 = !DIEnumerator(name: "DT_REG", value: 8)
!77 = !DIEnumerator(name: "DT_LNK", value: 10)
!78 = !DIEnumerator(name: "DT_SOCK", value: 12)
!79 = !DIEnumerator(name: "DT_WHT", value: 14)
!80 = !{!81, !6, !82, !10, !86, !7, !101, !45, !8}
!81 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !83, line: 92, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !85, line: 153, baseType: !81)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent64", file: !88, line: 37, size: 2240, elements: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!89 = !{!90, !92, !93, !95, !97}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !87, file: !88, line: 39, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !85, line: 149, baseType: !10)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !87, file: !88, line: 40, baseType: !84, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !87, file: !88, line: 41, baseType: !94, size: 16, offset: 128)
!94 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !87, file: !88, line: 42, baseType: !96, size: 8, offset: 144)
!96 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !87, file: !88, line: 43, baseType: !98, size: 2048, offset: 152)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !103, line: 26, size: 1152, elements: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "")
!104 = !{!105, !107, !109, !111, !113, !115, !117, !118, !119, !121, !123, !125, !133, !134, !135}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !102, file: !103, line: 31, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !85, line: 145, baseType: !10)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !102, file: !103, line: 36, baseType: !108, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !85, line: 148, baseType: !10)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !102, file: !103, line: 44, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !85, line: 151, baseType: !10)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !102, file: !103, line: 45, baseType: !112, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !85, line: 150, baseType: !62)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !102, file: !103, line: 47, baseType: !114, size: 32, offset: 224)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !85, line: 146, baseType: !62)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !102, file: !103, line: 48, baseType: !116, size: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !85, line: 147, baseType: !62)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !102, file: !103, line: 50, baseType: !45, size: 32, offset: 288)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !102, file: !103, line: 52, baseType: !106, size: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !102, file: !103, line: 57, baseType: !120, size: 64, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !85, line: 152, baseType: !81)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !102, file: !103, line: 61, baseType: !122, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !85, line: 175, baseType: !81)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !102, file: !103, line: 63, baseType: !124, size: 64, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !85, line: 180, baseType: !81)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !102, file: !103, line: 74, baseType: !126, size: 128, offset: 576)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !127, line: 11, size: 128, elements: !128)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!128 = !{!129, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !126, file: !127, line: 16, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !85, line: 160, baseType: !81)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !126, file: !127, line: 21, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !85, line: 197, baseType: !81)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !102, file: !103, line: 75, baseType: !126, size: 128, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !102, file: !103, line: 76, baseType: !126, size: 128, offset: 832)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !102, file: !103, line: 89, baseType: !136, size: 192, offset: 960)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 192, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 3)
!139 = !{!51, !140, !147, !154, !160, !165, !170}
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "n_calls", scope: !142, file: !54, line: 331, type: !45, isLocal: true, isDefinition: true)
!142 = distinct !DISubprogram(name: "read", scope: !54, file: !54, line: 330, type: !143, scopeLine: 330, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !45, !6, !23}
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !83, line: 108, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !85, line: 194, baseType: !81)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "n_calls", scope: !149, file: !54, line: 397, type: !45, isLocal: true, isDefinition: true)
!149 = distinct !DISubprogram(name: "write", scope: !54, file: !54, line: 396, type: !150, scopeLine: 396, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!150 = !DISubroutineType(types: !151)
!151 = !{!145, !45, !152, !23}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "n_calls", scope: !156, file: !54, line: 633, type: !45, isLocal: true, isDefinition: true)
!156 = distinct !DISubprogram(name: "chmod", scope: !54, file: !54, line: 632, type: !157, scopeLine: 632, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!157 = !DISubroutineType(types: !158)
!158 = !{!45, !29, !159}
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !83, line: 69, baseType: !112)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "n_calls", scope: !162, file: !54, line: 652, type: !45, isLocal: true, isDefinition: true)
!162 = distinct !DISubprogram(name: "fchmod", scope: !54, file: !54, line: 651, type: !163, scopeLine: 651, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!163 = !DISubroutineType(types: !164)
!164 = !{!45, !45, !159}
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "n_calls", scope: !167, file: !54, line: 738, type: !45, isLocal: true, isDefinition: true)
!167 = distinct !DISubprogram(name: "__fd_ftruncate", scope: !54, file: !54, line: 737, type: !168, scopeLine: 737, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!168 = !DISubroutineType(types: !169)
!169 = !{!45, !45, !82}
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "n_calls", scope: !172, file: !54, line: 1332, type: !45, isLocal: true, isDefinition: true)
!172 = distinct !DISubprogram(name: "getcwd", scope: !54, file: !54, line: 1331, type: !173, scopeLine: 1331, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!173 = !DISubroutineType(types: !174)
!174 = !{!7, !7, !23}
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "__global_locale_data", scope: !177, file: !212, line: 375, type: !451, isLocal: false, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "Ubuntu clang version 13.0.1-11ubuntu14.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !179, retainedTypes: !201, globals: !254, splitDebugInlining: false, nameTableKind: None)
!178 = !DIFile(filename: "libc/misc/locale/_locale_init.c", directory: "/home/mdshafiuzzaman/Research/klee/klee-uclibc")
!179 = !{!180, !186}
!180 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !181, line: 90, baseType: !62, size: 32, elements: !182)
!181 = !DIFile(filename: "./include/bits/uClibc_locale.h", directory: "/home/mdshafiuzzaman/Research/klee/klee-uclibc")
!182 = !{!183, !184, !185}
!183 = !DIEnumerator(name: "__ctype_encoding_7_bit", value: 0)
!184 = !DIEnumerator(name: "__ctype_encoding_utf8", value: 1)
!185 = !DIEnumerator(name: "__ctype_encoding_8_bit", value: 2)
!186 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !187, line: 48, baseType: !62, size: 32, elements: !188)
!187 = !DIFile(filename: "./include/ctype.h", directory: "/home/mdshafiuzzaman/Research/klee/klee-uclibc")
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200}
!189 = !DIEnumerator(name: "_ISupper", value: 256)
!190 = !DIEnumerator(name: "_ISlower", value: 512)
!191 = !DIEnumerator(name: "_ISalpha", value: 1024)
!192 = !DIEnumerator(name: "_ISdigit", value: 2048)
!193 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!194 = !DIEnumerator(name: "_ISspace", value: 8192)
!195 = !DIEnumerator(name: "_ISprint", value: 16384)
!196 = !DIEnumerator(name: "_ISgraph", value: 32768)
!197 = !DIEnumerator(name: "_ISblank", value: 1)
!198 = !DIEnumerator(name: "_IScntrl", value: 2)
!199 = !DIEnumerator(name: "_ISpunct", value: 4)
!200 = !DIEnumerator(name: "_ISalnum", value: 8)
!201 = !{!45, !202, !7, !203, !205, !208, !96, !209, !210, !223, !231, !10}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 52, baseType: !94)
!208 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_header_t", file: !212, line: 400, baseType: !213)
!212 = !DIFile(filename: "libc/misc/locale/locale.c", directory: "/home/mdshafiuzzaman/Research/klee/klee-uclibc")
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 390, size: 128, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "num_base", scope: !213, file: !212, line: 391, baseType: !207, size: 16)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num_der", scope: !213, file: !212, line: 392, baseType: !207, size: 16, offset: 16)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !213, file: !212, line: 393, baseType: !207, size: 16, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "num_index2weight", scope: !213, file: !212, line: 394, baseType: !207, size: 16, offset: 48)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "num_weightstr", scope: !213, file: !212, line: 396, baseType: !207, size: 16, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num_multistart", scope: !213, file: !212, line: 397, baseType: !207, size: 16, offset: 80)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "num_override", scope: !213, file: !212, line: 398, baseType: !207, size: 16, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num_ruletable", scope: !213, file: !212, line: 399, baseType: !207, size: 16, offset: 112)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_der_t", file: !212, line: 430, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 425, size: 64, elements: !226)
!226 = !{!227, !228, !229, !230}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "base_idx", scope: !225, file: !212, line: 426, baseType: !207, size: 16)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !225, file: !212, line: 427, baseType: !207, size: 16, offset: 16)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_offset", scope: !225, file: !212, line: 428, baseType: !207, size: 16, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !225, file: !212, line: 429, baseType: !207, size: 16, offset: 48)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_base_t", file: !212, line: 423, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 402, size: 304, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !233, file: !212, line: 403, baseType: !207, size: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !233, file: !212, line: 404, baseType: !207, size: 16, offset: 16)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !233, file: !212, line: 405, baseType: !207, size: 16, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !233, file: !212, line: 406, baseType: !207, size: 16, offset: 48)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !233, file: !212, line: 407, baseType: !207, size: 16, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !233, file: !212, line: 408, baseType: !207, size: 16, offset: 80)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !233, file: !212, line: 409, baseType: !207, size: 16, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !233, file: !212, line: 410, baseType: !207, size: 16, offset: 112)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !233, file: !212, line: 411, baseType: !207, size: 16, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !233, file: !212, line: 412, baseType: !207, size: 16, offset: 144)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !233, file: !212, line: 413, baseType: !207, size: 16, offset: 160)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !233, file: !212, line: 414, baseType: !207, size: 16, offset: 176)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !233, file: !212, line: 415, baseType: !207, size: 16, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !233, file: !212, line: 416, baseType: !207, size: 16, offset: 208)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_offset", scope: !233, file: !212, line: 418, baseType: !207, size: 16, offset: 224)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_offset", scope: !233, file: !212, line: 419, baseType: !207, size: 16, offset: 240)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !233, file: !212, line: 420, baseType: !207, size: 16, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_low", scope: !233, file: !212, line: 421, baseType: !207, size: 16, offset: 272)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_hi", scope: !233, file: !212, line: 422, baseType: !207, size: 16, offset: 288)
!254 = !{!255, !439, !175, !441, !444, !446}
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "__global_locale", scope: !177, file: !212, line: 377, type: !257, isLocal: false, isDefinition: true)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !181, line: 330, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !181, line: 154, size: 26560, elements: !260)
!260 = !{!261, !268, !274, !275, !279, !281, !282, !286, !290, !292, !293, !294, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !313, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !259, file: !181, line: 156, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_mask_t", file: !265, line: 38, baseType: !266)
!265 = !DIFile(filename: "./include/bits/uClibc_touplow.h", directory: "/home/mdshafiuzzaman/Research/klee/klee-uclibc")
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !267, line: 44, baseType: !94)
!267 = !DIFile(filename: "./include/bits/types.h", directory: "/home/mdshafiuzzaman/Research/klee/klee-uclibc")
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !259, file: !181, line: 157, baseType: !269, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_touplow_t", file: !265, line: 42, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !267, line: 43, baseType: !273)
!273 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !259, file: !181, line: 158, baseType: !269, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !259, file: !181, line: 162, baseType: !276, size: 6144, offset: 192)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 6144, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !259, file: !181, line: 163, baseType: !280, size: 6144, offset: 6336)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 6144, elements: !277)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !259, file: !181, line: 164, baseType: !280, size: 6144, offset: 12480)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !259, file: !181, line: 168, baseType: !283, size: 112, offset: 18624)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 112, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 14)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !259, file: !181, line: 174, baseType: !287, size: 96, offset: 18736)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 96, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 6)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !259, file: !181, line: 175, baseType: !291, size: 48, offset: 18832)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 48, elements: !288)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !259, file: !181, line: 178, baseType: !96, size: 8, offset: 18880)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !259, file: !181, line: 179, baseType: !96, size: 8, offset: 18888)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !259, file: !181, line: 180, baseType: !295, size: 80, offset: 18896)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 80, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 10)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !259, file: !181, line: 183, baseType: !203, size: 64, offset: 19008)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !259, file: !181, line: 184, baseType: !203, size: 64, offset: 19072)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !259, file: !181, line: 185, baseType: !203, size: 64, offset: 19136)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !259, file: !181, line: 186, baseType: !203, size: 64, offset: 19200)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !259, file: !181, line: 188, baseType: !203, size: 64, offset: 19264)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !259, file: !181, line: 189, baseType: !205, size: 64, offset: 19328)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !259, file: !181, line: 190, baseType: !203, size: 64, offset: 19392)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !259, file: !181, line: 191, baseType: !203, size: 64, offset: 19456)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !259, file: !181, line: 197, baseType: !205, size: 64, offset: 19520)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !259, file: !181, line: 199, baseType: !203, size: 64, offset: 19584)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !259, file: !181, line: 200, baseType: !203, size: 64, offset: 19648)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !259, file: !181, line: 202, baseType: !310, size: 64, offset: 19712)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !18, line: 40, baseType: !273)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !259, file: !181, line: 205, baseType: !314, size: 32, offset: 19776)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !24, line: 74, baseType: !45)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !259, file: !181, line: 206, baseType: !314, size: 32, offset: 19808)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !259, file: !181, line: 207, baseType: !45, size: 32, offset: 19840)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !259, file: !181, line: 208, baseType: !45, size: 32, offset: 19872)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !259, file: !181, line: 213, baseType: !29, size: 64, offset: 19904)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !259, file: !181, line: 214, baseType: !29, size: 64, offset: 19968)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !259, file: !181, line: 215, baseType: !29, size: 64, offset: 20032)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !259, file: !181, line: 216, baseType: !29, size: 64, offset: 20096)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !259, file: !181, line: 217, baseType: !29, size: 64, offset: 20160)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !259, file: !181, line: 218, baseType: !29, size: 64, offset: 20224)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !259, file: !181, line: 219, baseType: !29, size: 64, offset: 20288)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !259, file: !181, line: 220, baseType: !29, size: 64, offset: 20352)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !259, file: !181, line: 221, baseType: !29, size: 64, offset: 20416)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !259, file: !181, line: 222, baseType: !29, size: 64, offset: 20480)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !259, file: !181, line: 223, baseType: !29, size: 64, offset: 20544)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !259, file: !181, line: 226, baseType: !29, size: 64, offset: 20608)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !259, file: !181, line: 227, baseType: !29, size: 64, offset: 20672)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !259, file: !181, line: 228, baseType: !29, size: 64, offset: 20736)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !259, file: !181, line: 231, baseType: !29, size: 64, offset: 20800)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !259, file: !181, line: 232, baseType: !29, size: 64, offset: 20864)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !259, file: !181, line: 233, baseType: !29, size: 64, offset: 20928)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !259, file: !181, line: 234, baseType: !29, size: 64, offset: 20992)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !259, file: !181, line: 235, baseType: !29, size: 64, offset: 21056)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !259, file: !181, line: 236, baseType: !29, size: 64, offset: 21120)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !259, file: !181, line: 237, baseType: !29, size: 64, offset: 21184)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !259, file: !181, line: 238, baseType: !29, size: 64, offset: 21248)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !259, file: !181, line: 239, baseType: !29, size: 64, offset: 21312)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !259, file: !181, line: 240, baseType: !29, size: 64, offset: 21376)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !259, file: !181, line: 241, baseType: !29, size: 64, offset: 21440)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !259, file: !181, line: 242, baseType: !29, size: 64, offset: 21504)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !259, file: !181, line: 243, baseType: !29, size: 64, offset: 21568)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !259, file: !181, line: 244, baseType: !29, size: 64, offset: 21632)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !259, file: !181, line: 245, baseType: !29, size: 64, offset: 21696)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !259, file: !181, line: 246, baseType: !29, size: 64, offset: 21760)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !259, file: !181, line: 247, baseType: !29, size: 64, offset: 21824)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !259, file: !181, line: 248, baseType: !29, size: 64, offset: 21888)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !259, file: !181, line: 249, baseType: !29, size: 64, offset: 21952)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !259, file: !181, line: 250, baseType: !29, size: 64, offset: 22016)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !259, file: !181, line: 251, baseType: !29, size: 64, offset: 22080)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !259, file: !181, line: 253, baseType: !29, size: 64, offset: 22144)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !259, file: !181, line: 256, baseType: !29, size: 64, offset: 22208)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !259, file: !181, line: 257, baseType: !29, size: 64, offset: 22272)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !259, file: !181, line: 258, baseType: !29, size: 64, offset: 22336)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !259, file: !181, line: 259, baseType: !29, size: 64, offset: 22400)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !259, file: !181, line: 260, baseType: !29, size: 64, offset: 22464)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !259, file: !181, line: 261, baseType: !29, size: 64, offset: 22528)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !259, file: !181, line: 262, baseType: !29, size: 64, offset: 22592)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !259, file: !181, line: 264, baseType: !29, size: 64, offset: 22656)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !259, file: !181, line: 265, baseType: !29, size: 64, offset: 22720)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !259, file: !181, line: 266, baseType: !29, size: 64, offset: 22784)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !259, file: !181, line: 267, baseType: !29, size: 64, offset: 22848)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !259, file: !181, line: 268, baseType: !29, size: 64, offset: 22912)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !259, file: !181, line: 269, baseType: !29, size: 64, offset: 22976)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !259, file: !181, line: 270, baseType: !29, size: 64, offset: 23040)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !259, file: !181, line: 272, baseType: !29, size: 64, offset: 23104)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !259, file: !181, line: 273, baseType: !29, size: 64, offset: 23168)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !259, file: !181, line: 274, baseType: !29, size: 64, offset: 23232)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !259, file: !181, line: 275, baseType: !29, size: 64, offset: 23296)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !259, file: !181, line: 276, baseType: !29, size: 64, offset: 23360)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !259, file: !181, line: 277, baseType: !29, size: 64, offset: 23424)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !259, file: !181, line: 278, baseType: !29, size: 64, offset: 23488)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !259, file: !181, line: 279, baseType: !29, size: 64, offset: 23552)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !259, file: !181, line: 280, baseType: !29, size: 64, offset: 23616)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !259, file: !181, line: 281, baseType: !29, size: 64, offset: 23680)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !259, file: !181, line: 282, baseType: !29, size: 64, offset: 23744)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !259, file: !181, line: 283, baseType: !29, size: 64, offset: 23808)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !259, file: !181, line: 285, baseType: !29, size: 64, offset: 23872)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !259, file: !181, line: 286, baseType: !29, size: 64, offset: 23936)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !259, file: !181, line: 287, baseType: !29, size: 64, offset: 24000)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !259, file: !181, line: 288, baseType: !29, size: 64, offset: 24064)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !259, file: !181, line: 289, baseType: !29, size: 64, offset: 24128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !259, file: !181, line: 290, baseType: !29, size: 64, offset: 24192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !259, file: !181, line: 291, baseType: !29, size: 64, offset: 24256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !259, file: !181, line: 292, baseType: !29, size: 64, offset: 24320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !259, file: !181, line: 293, baseType: !29, size: 64, offset: 24384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !259, file: !181, line: 294, baseType: !29, size: 64, offset: 24448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !259, file: !181, line: 295, baseType: !29, size: 64, offset: 24512)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !259, file: !181, line: 296, baseType: !29, size: 64, offset: 24576)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !259, file: !181, line: 298, baseType: !29, size: 64, offset: 24640)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !259, file: !181, line: 299, baseType: !29, size: 64, offset: 24704)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !259, file: !181, line: 301, baseType: !29, size: 64, offset: 24768)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !259, file: !181, line: 302, baseType: !29, size: 64, offset: 24832)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !259, file: !181, line: 303, baseType: !29, size: 64, offset: 24896)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !259, file: !181, line: 304, baseType: !29, size: 64, offset: 24960)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !259, file: !181, line: 305, baseType: !29, size: 64, offset: 25024)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !259, file: !181, line: 307, baseType: !29, size: 64, offset: 25088)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !259, file: !181, line: 308, baseType: !29, size: 64, offset: 25152)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !259, file: !181, line: 309, baseType: !29, size: 64, offset: 25216)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !259, file: !181, line: 310, baseType: !29, size: 64, offset: 25280)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !259, file: !181, line: 311, baseType: !29, size: 64, offset: 25344)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !259, file: !181, line: 316, baseType: !29, size: 64, offset: 25408)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !259, file: !181, line: 317, baseType: !29, size: 64, offset: 25472)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !259, file: !181, line: 318, baseType: !29, size: 64, offset: 25536)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !259, file: !181, line: 319, baseType: !29, size: 64, offset: 25600)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !259, file: !181, line: 322, baseType: !409, size: 896, offset: 25664)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !181, line: 149, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !181, line: 111, size: 896, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !437, !438}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !410, file: !181, line: 112, baseType: !207, size: 16)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !410, file: !181, line: 113, baseType: !207, size: 16, offset: 16)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !410, file: !181, line: 114, baseType: !207, size: 16, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !410, file: !181, line: 115, baseType: !207, size: 16, offset: 48)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !410, file: !181, line: 116, baseType: !207, size: 16, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !410, file: !181, line: 117, baseType: !207, size: 16, offset: 80)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !410, file: !181, line: 118, baseType: !207, size: 16, offset: 96)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !410, file: !181, line: 119, baseType: !207, size: 16, offset: 112)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !410, file: !181, line: 120, baseType: !207, size: 16, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !410, file: !181, line: 121, baseType: !207, size: 16, offset: 144)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !410, file: !181, line: 122, baseType: !207, size: 16, offset: 160)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !410, file: !181, line: 123, baseType: !207, size: 16, offset: 176)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !410, file: !181, line: 124, baseType: !207, size: 16, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !410, file: !181, line: 125, baseType: !207, size: 16, offset: 208)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !410, file: !181, line: 127, baseType: !207, size: 16, offset: 224)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !410, file: !181, line: 128, baseType: !207, size: 16, offset: 240)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !410, file: !181, line: 130, baseType: !205, size: 64, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !410, file: !181, line: 131, baseType: !205, size: 64, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !410, file: !181, line: 132, baseType: !205, size: 64, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !410, file: !181, line: 135, baseType: !205, size: 64, offset: 448)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !410, file: !181, line: 138, baseType: !205, size: 64, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !410, file: !181, line: 141, baseType: !205, size: 64, offset: 576)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !410, file: !181, line: 142, baseType: !205, size: 64, offset: 640)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !410, file: !181, line: 145, baseType: !436, size: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !410, file: !181, line: 146, baseType: !436, size: 64, offset: 768)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !410, file: !181, line: 148, baseType: !207, size: 16, offset: 832)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "__curlocale_var", scope: !177, file: !212, line: 380, type: !257, isLocal: false, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "utf8", scope: !177, file: !212, line: 387, type: !443, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 48, elements: !288)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "ascii", scope: !177, file: !212, line: 388, type: !443, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "__code2flag", scope: !177, file: !212, line: 854, type: !448, isLocal: true, isDefinition: true)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 256, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 16)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uclibc_locale_t", file: !181, line: 324, baseType: !259)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "_stdio_streams", scope: !454, file: !455, line: 131, type: !499, isLocal: true, isDefinition: true)
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "Ubuntu clang version 13.0.1-11ubuntu14.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !456, splitDebugInlining: false, nameTableKind: None)
!455 = !DIFile(filename: "libc/stdio/_stdio.c", directory: "/home/mdshafiuzzaman/Research/klee/klee-uclibc")
!456 = !{!457, !489, !491, !493, !495, !497, !452}
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "stdin", scope: !454, file: !455, line: 154, type: !459, isLocal: false, isDefinition: true)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !461, line: 46, baseType: !462)
!461 = !DIFile(filename: "./include/stdio.h", directory: "/home/mdshafiuzzaman/Research/klee/klee-uclibc")
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !463, line: 233, size: 704, elements: !464)
!463 = !DIFile(filename: "./include/bits/uClibc_stdio.h", directory: "/home/mdshafiuzzaman/Research/klee/klee-uclibc")
!464 = !{!465, !466, !470, !471, !472, !473, !474, !475, !476, !477, !479, !481, !488}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !462, file: !463, line: 234, baseType: !94, size: 16)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !462, file: !463, line: 237, baseType: !467, size: 16, offset: 16)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 16, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 2)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !462, file: !463, line: 244, baseType: !45, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !462, file: !463, line: 246, baseType: !209, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !462, file: !463, line: 247, baseType: !209, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !462, file: !463, line: 248, baseType: !209, size: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !462, file: !463, line: 249, baseType: !209, size: 64, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !462, file: !463, line: 252, baseType: !209, size: 64, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !462, file: !463, line: 255, baseType: !209, size: 64, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !462, file: !463, line: 261, baseType: !478, size: 64, offset: 448)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !462, file: !463, line: 268, baseType: !480, size: 64, offset: 512)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 64, elements: !468)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !462, file: !463, line: 271, baseType: !482, size: 64, offset: 576)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !483, line: 85, baseType: !484)
!483 = !DIFile(filename: "./include/wchar.h", directory: "/home/mdshafiuzzaman/Research/klee/klee-uclibc")
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !483, line: 81, size: 64, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !484, file: !483, line: 83, baseType: !314, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !484, file: !483, line: 84, baseType: !314, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !462, file: !463, line: 274, baseType: !6, size: 64, offset: 640)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "stdout", scope: !454, file: !455, line: 155, type: !459, isLocal: false, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "stderr", scope: !454, file: !455, line: 156, type: !459, isLocal: false, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "__stdin", scope: !454, file: !455, line: 159, type: !459, isLocal: false, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "__stdout", scope: !454, file: !455, line: 162, type: !459, isLocal: false, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "_stdio_openlist", scope: !454, file: !455, line: 180, type: !459, isLocal: false, isDefinition: true)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 2112, elements: !137)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !502, file: !503, line: 49, type: !45, isLocal: true, isDefinition: true)
!502 = distinct !DICompileUnit(language: DW_LANG_C99, file: !503, producer: "Ubuntu clang version 13.0.1-11ubuntu14.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !504, globals: !518, splitDebugInlining: false, nameTableKind: None)
!503 = !DIFile(filename: "libc/stdlib/abort.c", directory: "/home/mdshafiuzzaman/Research/klee/klee-uclibc")
!504 = !{!505, !6, !514}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !507, line: 50, baseType: !508)
!507 = !DIFile(filename: "./include/signal.h", directory: "/home/mdshafiuzzaman/Research/klee/klee-uclibc")
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !509, line: 31, baseType: !510)
!509 = !DIFile(filename: "./include/bits/sigset.h", directory: "/home/mdshafiuzzaman/Research/klee/klee-uclibc")
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !509, line: 28, size: 1024, elements: !511)
!511 = !{!512}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !510, file: !509, line: 30, baseType: !513, size: 1024)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, elements: !449)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !507, line: 75, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !45}
!518 = !{!500}
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "__exit_cleanup", scope: !521, file: !524, line: 309, type: !515, isLocal: false, isDefinition: true)
!521 = distinct !DICompileUnit(language: DW_LANG_C99, file: !522, producer: "Ubuntu clang version 13.0.1-11ubuntu14.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !523, splitDebugInlining: false, nameTableKind: None)
!522 = !DIFile(filename: "libc/stdlib/exit.c", directory: "/home/mdshafiuzzaman/Research/klee/klee-uclibc")
!523 = !{!519}
!524 = !DIFile(filename: "libc/stdlib/_atexit.c", directory: "/home/mdshafiuzzaman/Research/klee/klee-uclibc")
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "mAtRuntime", scope: !527, file: !721, line: 39, type: !597, isLocal: false, isDefinition: true)
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !528, producer: "Ubuntu clang version 13.0.1-13", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !529, retainedTypes: !585, globals: !718, splitDebugInlining: false, nameTableKind: None)
!528 = !DIFile(filename: "klee_driver.c", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/edk2_klee")
!529 = !{!530, !537, !543, !549, !552, !572, !579}
!530 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !531, line: 14, baseType: !62, size: 32, elements: !532)
!531 = !DIFile(filename: "edk2-master/MdeModulePkg/Include/Library/VarCheckLib.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/edk2_klee")
!532 = !{!533, !534, !535, !536}
!533 = !DIEnumerator(name: "VarCheckRequestReserved0", value: 0)
!534 = !DIEnumerator(name: "VarCheckRequestReserved1", value: 1)
!535 = !DIEnumerator(name: "VarCheckFromTrusted", value: 2)
!536 = !DIEnumerator(name: "VarCheckFromUntrusted", value: 3)
!537 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !538, line: 49, baseType: !62, size: 32, elements: !539)
!538 = !DIFile(filename: "edk2-master/MdePkg/Include/Library/UefiLib.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/edk2_klee")
!539 = !{!540, !541, !542}
!540 = !DIEnumerator(name: "EfiLockUninitialized", value: 0)
!541 = !DIEnumerator(name: "EfiLockReleased", value: 1)
!542 = !DIEnumerator(name: "EfiLockAcquired", value: 2)
!543 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !544, line: 1475, baseType: !62, size: 32, elements: !545)
!544 = !DIFile(filename: "edk2-master/MdePkg/Include/Uefi/UefiSpec.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/edk2_klee")
!545 = !{!546, !547, !548}
!546 = !DIEnumerator(name: "AllHandles", value: 0)
!547 = !DIEnumerator(name: "ByRegisterNotify", value: 1)
!548 = !DIEnumerator(name: "ByProtocol", value: 2)
!549 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !544, line: 1159, baseType: !62, size: 32, elements: !550)
!550 = !{!551}
!551 = !DIEnumerator(name: "EFI_NATIVE_INTERFACE", value: 0)
!552 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !553, line: 38, baseType: !62, size: 32, elements: !554)
!553 = !DIFile(filename: "edk2-master/MdePkg/Include/Uefi/UefiMultiPhase.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/edk2_klee")
!554 = !{!555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571}
!555 = !DIEnumerator(name: "EfiReservedMemoryType", value: 0)
!556 = !DIEnumerator(name: "EfiLoaderCode", value: 1)
!557 = !DIEnumerator(name: "EfiLoaderData", value: 2)
!558 = !DIEnumerator(name: "EfiBootServicesCode", value: 3)
!559 = !DIEnumerator(name: "EfiBootServicesData", value: 4)
!560 = !DIEnumerator(name: "EfiRuntimeServicesCode", value: 5)
!561 = !DIEnumerator(name: "EfiRuntimeServicesData", value: 6)
!562 = !DIEnumerator(name: "EfiConventionalMemory", value: 7)
!563 = !DIEnumerator(name: "EfiUnusableMemory", value: 8)
!564 = !DIEnumerator(name: "EfiACPIReclaimMemory", value: 9)
!565 = !DIEnumerator(name: "EfiACPIMemoryNVS", value: 10)
!566 = !DIEnumerator(name: "EfiMemoryMappedIO", value: 11)
!567 = !DIEnumerator(name: "EfiMemoryMappedIOPortSpace", value: 12)
!568 = !DIEnumerator(name: "EfiPalCode", value: 13)
!569 = !DIEnumerator(name: "EfiPersistentMemory", value: 14)
!570 = !DIEnumerator(name: "EfiUnacceptedMemoryType", value: 15)
!571 = !DIEnumerator(name: "EfiMaxMemoryType", value: 16)
!572 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !573, line: 24, baseType: !62, size: 32, elements: !574)
!573 = !DIFile(filename: "edk2-master/MdePkg/Include/Protocol/MmCpuIo.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/edk2_klee")
!574 = !{!575, !576, !577, !578}
!575 = !DIEnumerator(name: "MM_IO_UINT8", value: 0)
!576 = !DIEnumerator(name: "MM_IO_UINT16", value: 1)
!577 = !DIEnumerator(name: "MM_IO_UINT32", value: 2)
!578 = !DIEnumerator(name: "MM_IO_UINT64", value: 3)
!579 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !544, line: 29, baseType: !62, size: 32, elements: !580)
!580 = !{!581, !582, !583, !584}
!581 = !DIEnumerator(name: "AllocateAnyPages", value: 0)
!582 = !DIEnumerator(name: "AllocateMaxAddress", value: 1)
!583 = !DIEnumerator(name: "AllocateAddress", value: 2)
!584 = !DIEnumerator(name: "MaxAllocateType", value: 3)
!585 = !{!6, !586, !587, !592, !595, !589, !597, !598, !612, !635, !636, !643, !651, !656, !670, !672, !689, !698, !622, !710}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "RETURN_STATUS", file: !588, line: 1026, baseType: !589)
!588 = !DIFile(filename: "edk2-master/MdePkg/Include/Base.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/edk2_klee")
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTN", file: !590, line: 211, baseType: !591)
!590 = !DIFile(filename: "./edk2-master/MdePkg/Include/X64/ProcessorBind.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/edk2_klee")
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT64", file: !590, line: 162, baseType: !25)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTN", file: !590, line: 216, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT64", file: !590, line: 166, baseType: !594)
!594 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "CHAR16", file: !590, line: 183, baseType: !94)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "BOOLEAN", file: !590, line: 192, baseType: !96)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_HEADER", file: !600, line: 29, baseType: !601)
!600 = !DIFile(filename: "edk2-master/MdeModulePkg/Include/Guid/SmmVariableCommon.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/edk2_klee")
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !600, line: 25, size: 192, elements: !602)
!602 = !{!603, !604, !607}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "Function", scope: !601, file: !600, line: 26, baseType: !589, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ReturnStatus", scope: !601, file: !600, line: 27, baseType: !605, size: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_STATUS", file: !606, line: 29, baseType: !587)
!606 = !DIFile(filename: "edk2-master/MdePkg/Include/Uefi/UefiBaseType.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/edk2_klee")
!607 = !DIDerivedType(tag: DW_TAG_member, name: "Data", scope: !601, file: !600, line: 28, baseType: !608, size: 8, offset: 128)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 8, elements: !610)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !590, line: 196, baseType: !96)
!610 = !{!611}
!611 = !DISubrange(count: 1)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_ACCESS_VARIABLE", file: !600, line: 100, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !600, line: 94, size: 320, elements: !615)
!615 = !{!616, !630, !631, !632, !633}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !614, file: !600, line: 95, baseType: !617, size: 128)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GUID", file: !606, line: 25, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "GUID", file: !588, line: 218, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !588, line: 213, size: 128, elements: !620)
!620 = !{!621, !623, !625, !626}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "Data1", scope: !619, file: !588, line: 214, baseType: !622, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !590, line: 170, baseType: !62)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "Data2", scope: !619, file: !588, line: 215, baseType: !624, size: 16, offset: 32)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !590, line: 178, baseType: !94)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "Data3", scope: !619, file: !588, line: 216, baseType: !624, size: 16, offset: 48)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "Data4", scope: !619, file: !588, line: 217, baseType: !627, size: 64, offset: 64)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 64, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 8)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "DataSize", scope: !614, file: !600, line: 96, baseType: !589, size: 64, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "NameSize", scope: !614, file: !600, line: 97, baseType: !589, size: 64, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !614, file: !600, line: 98, baseType: !622, size: 32, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !614, file: !600, line: 99, baseType: !634, size: 16, offset: 288)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 16, elements: !610)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_GET_NEXT_VARIABLE_NAME", file: !600, line: 109, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !600, line: 105, size: 256, elements: !639)
!639 = !{!640, !641, !642}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !638, file: !600, line: 106, baseType: !617, size: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "NameSize", scope: !638, file: !600, line: 107, baseType: !589, size: 64, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !638, file: !600, line: 108, baseType: !634, size: 16, offset: 192)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_QUERY_VARIABLE_INFO", file: !600, line: 119, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !600, line: 114, size: 256, elements: !646)
!646 = !{!647, !648, !649, !650}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumVariableStorageSize", scope: !645, file: !600, line: 115, baseType: !591, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "RemainingVariableStorageSize", scope: !645, file: !600, line: 116, baseType: !591, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "MaximumVariableSize", scope: !645, file: !600, line: 117, baseType: !591, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !645, file: !600, line: 118, baseType: !622, size: 32, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_GET_PAYLOAD_SIZE", file: !600, line: 132, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !600, line: 130, size: 64, elements: !654)
!654 = !{!655}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "VariablePayloadSize", scope: !653, file: !600, line: 131, baseType: !589, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "VARIABLE_INFO_ENTRY", file: !658, line: 202, baseType: !659)
!658 = !DIFile(filename: "edk2-master/MdeModulePkg/Include/Guid/VariableFormat.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/edk2_klee")
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_VARIABLE_INFO_ENTRY", file: !658, line: 209, size: 448, elements: !660)
!660 = !{!661, !662, !663, !664, !665, !666, !667, !668, !669}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !659, file: !658, line: 210, baseType: !656, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "VendorGuid", scope: !659, file: !658, line: 211, baseType: !617, size: 128, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !659, file: !658, line: 212, baseType: !595, size: 64, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !659, file: !658, line: 213, baseType: !622, size: 32, offset: 256)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ReadCount", scope: !659, file: !658, line: 214, baseType: !622, size: 32, offset: 288)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "WriteCount", scope: !659, file: !658, line: 215, baseType: !622, size: 32, offset: 320)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteCount", scope: !659, file: !658, line: 216, baseType: !622, size: 32, offset: 352)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "CacheCount", scope: !659, file: !658, line: 217, baseType: !622, size: 32, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Volatile", scope: !659, file: !658, line: 218, baseType: !597, size: 8, offset: 416)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_LOCK_VARIABLE", file: !600, line: 121, baseType: !637)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_VAR_CHECK_VARIABLE_PROPERTY", file: !600, line: 128, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !600, line: 123, size: 448, elements: !675)
!675 = !{!676, !677, !678, !688}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Guid", scope: !674, file: !600, line: 124, baseType: !617, size: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "NameSize", scope: !674, file: !600, line: 125, baseType: !589, size: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "VariableProperty", scope: !674, file: !600, line: 126, baseType: !679, size: 192, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "VAR_CHECK_VARIABLE_PROPERTY", file: !680, line: 58, baseType: !681)
!680 = !DIFile(filename: "edk2-master/MdeModulePkg/Include/Protocol/VarCheck.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/edk2_klee")
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !680, line: 52, size: 192, elements: !682)
!682 = !{!683, !684, !685, !686, !687}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !681, file: !680, line: 53, baseType: !624, size: 16)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "Property", scope: !681, file: !680, line: 54, baseType: !624, size: 16, offset: 16)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !681, file: !680, line: 55, baseType: !622, size: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "MinSize", scope: !681, file: !680, line: 56, baseType: !589, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "MaxSize", scope: !681, file: !680, line: 57, baseType: !589, size: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "Name", scope: !674, file: !600, line: 127, baseType: !634, size: 16, offset: 384)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_RUNTIME_VARIABLE_CACHE_CONTEXT", file: !600, line: 141, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !600, line: 134, size: 384, elements: !692)
!692 = !{!693, !695, !696, !697, !708, !709}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ReadLock", scope: !691, file: !600, line: 135, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "PendingUpdate", scope: !691, file: !600, line: 136, baseType: !694, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "HobFlushComplete", scope: !691, file: !600, line: 137, baseType: !694, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "RuntimeHobCache", scope: !691, file: !600, line: 138, baseType: !698, size: 64, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "VARIABLE_STORE_HEADER", file: !658, line: 87, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !658, line: 67, size: 224, elements: !701)
!701 = !{!702, !703, !704, !705, !706, !707}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !700, file: !658, line: 71, baseType: !617, size: 128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !700, file: !658, line: 76, baseType: !622, size: 32, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "Format", scope: !700, file: !658, line: 80, baseType: !609, size: 8, offset: 160)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "State", scope: !700, file: !658, line: 84, baseType: !609, size: 8, offset: 168)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !700, file: !658, line: 85, baseType: !624, size: 16, offset: 176)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !700, file: !658, line: 86, baseType: !622, size: 32, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "RuntimeNvCache", scope: !691, file: !600, line: 139, baseType: !698, size: 64, offset: 256)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "RuntimeVolatileCache", scope: !691, file: !600, line: 140, baseType: !698, size: 64, offset: 320)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "SMM_VARIABLE_COMMUNICATE_GET_RUNTIME_CACHE_INFO", file: !600, line: 148, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !600, line: 143, size: 256, elements: !713)
!713 = !{!714, !715, !716, !717}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "TotalHobStorageSize", scope: !712, file: !600, line: 144, baseType: !589, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "TotalNvStorageSize", scope: !712, file: !600, line: 145, baseType: !589, size: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "TotalVolatileStorageSize", scope: !712, file: !600, line: 146, baseType: !589, size: 64, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "AuthenticatedVariableUsage", scope: !712, file: !600, line: 147, baseType: !597, size: 8, offset: 192)
!718 = !{!525, !719, !722, !752, !772, !775, !923, !925, !927, !929, !931, !933, !959, !961, !963, !965, !1070}
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "mVariableBufferPayload", scope: !527, file: !721, line: 40, type: !635, isLocal: false, isDefinition: true)
!721 = !DIFile(filename: "./edk2-master/MdeModulePkg/Universal/Variable/RuntimeDxe/VariableSmm.c", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/edk2_klee")
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "gSmmVariable", scope: !527, file: !721, line: 102, type: !724, isLocal: false, isDefinition: true)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SMM_VARIABLE_PROTOCOL", file: !725, line: 18, baseType: !726)
!725 = !DIFile(filename: "edk2-master/MdeModulePkg/Include/Protocol/SmmVariable.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/edk2_klee")
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_SMM_VARIABLE_PROTOCOL", file: !725, line: 24, size: 256, elements: !727)
!727 = !{!728, !736, !741, !746}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "SmmGetVariable", scope: !726, file: !725, line: 25, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_VARIABLE", file: !544, line: 686, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!605, !595, !733, !734, !735, !6}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "SmmGetNextVariableName", scope: !726, file: !725, line: 26, baseType: !737, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_GET_NEXT_VARIABLE_NAME", file: !544, line: 722, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!605, !735, !595, !733}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "SmmSetVariable", scope: !726, file: !725, line: 27, baseType: !742, size: 64, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_SET_VARIABLE", file: !544, line: 764, baseType: !743)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{!605, !595, !733, !622, !589, !6}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "SmmQueryVariableInfo", scope: !726, file: !725, line: 28, baseType: !747, size: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_QUERY_VARIABLE_INFO", file: !544, line: 1785, baseType: !748)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{!605, !622, !751, !751, !751}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "mSmmVarCheck", scope: !527, file: !721, line: 108, type: !754, isLocal: false, isDefinition: true)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDKII_SMM_VAR_CHECK_PROTOCOL", file: !755, line: 19, baseType: !756)
!755 = !DIFile(filename: "edk2-master/MdeModulePkg/Include/Protocol/SmmVarCheck.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/edk2_klee")
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EDKII_SMM_VAR_CHECK_PROTOCOL", file: !755, line: 21, size: 192, elements: !757)
!757 = !{!758, !764, !770}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "SmmRegisterSetVariableCheckHandler", scope: !756, file: !755, line: 22, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDKII_VAR_CHECK_REGISTER_SET_VARIABLE_CHECK_HANDLER", file: !680, line: 39, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!605, !763}
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "VAR_CHECK_SET_VARIABLE_CHECK_HANDLER", file: !680, line: 20, baseType: !742)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "SmmVariablePropertySet", scope: !756, file: !755, line: 23, baseType: !765, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDKII_VAR_CHECK_VARIABLE_PROPERTY_SET", file: !680, line: 85, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{!605, !595, !733, !769}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "SmmVariablePropertyGet", scope: !756, file: !755, line: 24, baseType: !771, size: 64, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "EDKII_VAR_CHECK_VARIABLE_PROPERTY_GET", file: !680, line: 105, baseType: !766)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "mRequestSource", scope: !527, file: !528, line: 25, type: !774, isLocal: false, isDefinition: true)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "VAR_CHECK_REQUEST_SOURCE", file: !531, line: 19, baseType: !530)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "gMmst", scope: !527, file: !528, line: 27, type: !777, isLocal: false, isDefinition: true)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_SYSTEM_TABLE", file: !779, line: 16, baseType: !780)
!779 = !DIFile(filename: "edk2-master/MdePkg/Include/Pi/PiMmCis.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/edk2_klee")
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_MM_SYSTEM_TABLE", file: !779, line: 252, size: 1920, elements: !781)
!781 = !{!782, !791, !792, !793, !802, !820, !826, !831, !839, !844, !854, !855, !856, !857, !858, !859, !866, !874, !879, !884, !893, !899, !904, !909, !918}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "Hdr", scope: !780, file: !779, line: 256, baseType: !783, size: 192)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_TABLE_HEADER", file: !553, line: 177, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 150, size: 192, elements: !785)
!785 = !{!786, !787, !788, !789, !790}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !784, file: !553, line: 156, baseType: !591, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !784, file: !553, line: 163, baseType: !622, size: 32, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderSize", scope: !784, file: !553, line: 167, baseType: !622, size: 32, offset: 96)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "CRC32", scope: !784, file: !553, line: 172, baseType: !622, size: 32, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !784, file: !553, line: 176, baseType: !622, size: 32, offset: 160)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "MmFirmwareVendor", scope: !780, file: !779, line: 261, baseType: !595, size: 64, offset: 192)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "MmFirmwareRevision", scope: !780, file: !779, line: 265, baseType: !622, size: 32, offset: 256)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "MmInstallConfigurationTable", scope: !780, file: !779, line: 267, baseType: !794, size: 64, offset: 320)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_INSTALL_CONFIGURATION_TABLE", file: !779, line: 49, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{!605, !798, !800, !6, !589}
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !778)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !617)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "MmIo", scope: !780, file: !779, line: 272, baseType: !803, size: 256, offset: 384)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_CPU_IO_PROTOCOL", file: !573, line: 19, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_EFI_MM_CPU_IO_PROTOCOL", file: !573, line: 77, size: 256, elements: !805)
!805 = !{!806, !819}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "Mem", scope: !804, file: !573, line: 81, baseType: !807, size: 128)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_IO_ACCESS", file: !573, line: 72, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !573, line: 63, size: 128, elements: !809)
!809 = !{!810, !818}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "Read", scope: !808, file: !573, line: 67, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_CPU_IO", file: !573, line: 55, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DISubroutineType(types: !814)
!814 = !{!605, !815, !817, !591, !589, !6}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !803)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_IO_WIDTH", file: !573, line: 29, baseType: !572)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "Write", scope: !808, file: !573, line: 71, baseType: !811, size: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "Io", scope: !804, file: !573, line: 85, baseType: !807, size: 128, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "MmAllocatePool", scope: !780, file: !779, line: 277, baseType: !821, size: 64, offset: 640)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_POOL", file: !544, line: 285, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!605, !825, !589, !586}
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MEMORY_TYPE", file: !553, line: 112, baseType: !552)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "MmFreePool", scope: !780, file: !779, line: 278, baseType: !827, size: 64, offset: 704)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FREE_POOL", file: !544, line: 302, baseType: !828)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{!605, !6}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "MmAllocatePages", scope: !780, file: !779, line: 279, baseType: !832, size: 64, offset: 768)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_PAGES", file: !544, line: 203, baseType: !833)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{!605, !836, !825, !589, !837}
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_ALLOCATE_TYPE", file: !544, line: 47, baseType: !579)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_PHYSICAL_ADDRESS", file: !606, line: 50, baseType: !591)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "MmFreePages", scope: !780, file: !779, line: 280, baseType: !840, size: 64, offset: 832)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FREE_PAGES", file: !544, line: 224, baseType: !841)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!605, !838, !589}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "MmStartupThisAp", scope: !780, file: !779, line: 285, baseType: !845, size: 64, offset: 896)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_STARTUP_THIS_AP", file: !779, line: 74, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!605, !849, !589, !6}
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_AP_PROCEDURE", file: !850, line: 191, baseType: !851)
!850 = !DIFile(filename: "edk2-master/MdePkg/Include/Pi/PiMultiPhase.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/edk2_klee")
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{null, !6}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "CurrentlyExecutingCpu", scope: !780, file: !779, line: 295, baseType: !589, size: 64, offset: 960)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfCpus", scope: !780, file: !779, line: 299, baseType: !589, size: 64, offset: 1024)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "CpuSaveStateSize", scope: !780, file: !779, line: 305, baseType: !735, size: 64, offset: 1088)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "CpuSaveState", scope: !780, file: !779, line: 311, baseType: !586, size: 64, offset: 1152)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfTableEntries", scope: !780, file: !779, line: 320, baseType: !589, size: 64, offset: 1216)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "MmConfigurationTable", scope: !780, file: !779, line: 325, baseType: !860, size: 64, offset: 1280)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_CONFIGURATION_TABLE", file: !544, line: 1987, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !544, line: 1978, size: 192, elements: !863)
!863 = !{!864, !865}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "VendorGuid", scope: !862, file: !544, line: 1982, baseType: !617, size: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "VendorTable", scope: !862, file: !544, line: 1986, baseType: !6, size: 64, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "MmInstallProtocolInterface", scope: !780, file: !779, line: 330, baseType: !867, size: 64, offset: 1344)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INSTALL_PROTOCOL_INTERFACE", file: !544, line: 1188, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{!605, !871, !733, !873, !6}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE", file: !606, line: 33, baseType: !6)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_INTERFACE_TYPE", file: !544, line: 1164, baseType: !549)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "MmUninstallProtocolInterface", scope: !780, file: !779, line: 331, baseType: !875, size: 64, offset: 1408)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_UNINSTALL_PROTOCOL_INTERFACE", file: !544, line: 1264, baseType: !876)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!605, !872, !733, !6}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "MmHandleProtocol", scope: !780, file: !779, line: 332, baseType: !880, size: 64, offset: 1472)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_HANDLE_PROTOCOL", file: !544, line: 1305, baseType: !881)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!605, !872, !733, !586}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "MmRegisterProtocolNotify", scope: !780, file: !779, line: 333, baseType: !885, size: 64, offset: 1536)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_REGISTER_PROTOCOL_NOTIFY", file: !779, line: 117, baseType: !886)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!605, !800, !889, !586}
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_NOTIFY_FN", file: !779, line: 91, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!605, !800, !6, !872}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "MmLocateHandle", scope: !780, file: !779, line: 334, baseType: !894, size: 64, offset: 1600)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_HANDLE", file: !544, line: 1515, baseType: !895)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{!605, !898, !733, !6, !735, !871}
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_SEARCH_TYPE", file: !544, line: 1489, baseType: !543)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "MmLocateProtocol", scope: !780, file: !779, line: 335, baseType: !900, size: 64, offset: 1664)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_LOCATE_PROTOCOL", file: !544, line: 1615, baseType: !901)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!605, !733, !6, !586}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "MmiManage", scope: !780, file: !779, line: 340, baseType: !905, size: 64, offset: 1728)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_INTERRUPT_MANAGE", file: !779, line: 138, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!605, !800, !152, !6, !735}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "MmiHandlerRegister", scope: !780, file: !779, line: 341, baseType: !910, size: 64, offset: 1792)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_INTERRUPT_REGISTER", file: !779, line: 185, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{!605, !914, !800, !871}
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_HANDLER_ENTRY_POINT", file: !779, line: 165, baseType: !915)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!605, !872, !152, !6, !735}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "MmiHandlerUnRegister", scope: !780, file: !779, line: 342, baseType: !919, size: 64, offset: 1856)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_MM_INTERRUPT_UNREGISTER", file: !779, line: 201, baseType: !920)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!605, !872}
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(name: "gEfiSmmFaultTolerantWriteProtocolGuid", scope: !527, file: !528, line: 30, type: !617, isLocal: false, isDefinition: true)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(name: "gEfiSmmFirmwareVolumeBlockProtocolGuid", scope: !527, file: !528, line: 33, type: !617, isLocal: false, isDefinition: true)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(name: "gVariableInfo", scope: !527, file: !528, line: 37, type: !656, isLocal: false, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(name: "mEndOfDxe", scope: !527, file: !528, line: 42, type: !597, isLocal: false, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(name: "mNvVariableCache", scope: !527, file: !528, line: 44, type: !698, isLocal: false, isDefinition: true)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(name: "mNvFvHeaderCache", scope: !527, file: !528, line: 45, type: !935, isLocal: false, isDefinition: true)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FIRMWARE_VOLUME_HEADER", file: !937, line: 104, baseType: !938)
!937 = !DIFile(filename: "./edk2-master/BaseTools/Source/C/Include/Common/PiFirmwareVolume.h", directory: "/home/mdshafiuzzaman/Research/ISSTA24/Experiments/edk2_klee")
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !937, line: 92, size: 512, elements: !939)
!939 = !{!940, !942, !943, !944, !945, !947, !948, !949, !950, !951, !952}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroVector", scope: !938, file: !937, line: 93, baseType: !941, size: 128)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 128, elements: !449)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "FileSystemGuid", scope: !938, file: !937, line: 94, baseType: !617, size: 128, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "FvLength", scope: !938, file: !937, line: 95, baseType: !591, size: 64, offset: 256)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !938, file: !937, line: 96, baseType: !622, size: 32, offset: 320)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "Attributes", scope: !938, file: !937, line: 97, baseType: !946, size: 32, offset: 352)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FVB_ATTRIBUTES_2", file: !937, line: 28, baseType: !622)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "HeaderLength", scope: !938, file: !937, line: 98, baseType: !624, size: 16, offset: 384)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "Checksum", scope: !938, file: !937, line: 99, baseType: !624, size: 16, offset: 400)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ExtHeaderOffset", scope: !938, file: !937, line: 100, baseType: !624, size: 16, offset: 416)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved", scope: !938, file: !937, line: 101, baseType: !608, size: 8, offset: 432)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "Revision", scope: !938, file: !937, line: 102, baseType: !609, size: 8, offset: 440)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "BlockMap", scope: !938, file: !937, line: 103, baseType: !953, size: 64, offset: 448)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 64, elements: !610)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "EFI_FV_BLOCK_MAP_ENTRY", file: !937, line: 87, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !937, line: 84, size: 64, elements: !956)
!956 = !{!957, !958}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "NumBlocks", scope: !955, file: !937, line: 85, baseType: !622, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "Length", scope: !955, file: !937, line: 86, baseType: !622, size: 32, offset: 32)
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
